{
    "Reviews": [
        {
            "name": "Andrew Welsh",
            "rating": 5,
            "reviewText": "I could not have asked for a better experience for my first time on lake Travis. As a seasoned boater, I thought about opting for a rental without a captain but decided otherwise so I can enjoy the lake with my wife and our 4 kids and boy did I make the right choice! I was blown away by Robert’s skills behind the wheel, friendliness, and professionalism. As an avid boater and fisherman myself, Rob’s knowledge of the Lake really took this experience to another level. My younger daughters were weary as it was their first time on a boat, but Rob did a fantastic job driving safely and calming them with his humor and fantastic personality. I already booked another rental with some of my friends visiting in a few weeks and can’t wait to get back on Lake Travis and hopefully see Rob again.",
            "editable": false
        },
        {
            "name": "Madison Binsfeld",
            "rating": 5,
            "reviewText": "SO FUN! The guys are super efficient as well, we definitely got the most for our rental! We had plenty of time to enjoy all of the hot spots of Lake Travis. 10/10 recommend :) (also for a STEAL of a deal, we will be back for sure).",
            "editable": false
        },
        {
            "name": "Kevin Whaling",
            "rating": 5,
            "reviewText": "We had a wonderfully time on the lake. My only complaint would be...I wish it was longer than 4 hours. We will absolutely keep coming back!",
            "editable": false
        },
        {
            "name": "Raquel Ramos",
            "rating": 5,
            "reviewText": "Had the best time on Lake Travis! Very easy to book and by far the best price available. Noah was our driver and he was great! Will definitely book again.",
            "editable": false
        },
        {
            "name": "Trista Jones",
            "rating": 5,
            "reviewText": "I would highly recommend Shaky Pale Marine.  I had friends in from out of town and it was a perfect way to spend a sunny hot day.  Robert, our captain made an effort to engage with everyone on the boat and made the day so much fun.  I live in Austin and can't wait to get my friends who live here together to go out again.",
            "editable": false
        },
        {
            "name": "Aidan Berry",
            "rating": 5,
            "reviewText": "Super organized boat rental and a great day out in lake Travis. Highly recommended for anyone looking for a good time. Captain was highly qualified and navigated the lake with extreme expertise. We will be back.",
            "editable": false
        },
        {
            "name": "Heather P.",
            "rating": 5,
            "reviewText": "Last Sunday I rented a boat for my birthday. Noah was the captain and he was great, we all had so much fun and definitely are looking forward to booking in the future!",
            "editable": false
        },
        {
            "name": "Shane Rumbaugh",
            "rating": 5,
            "reviewText": "If you're looking for something to do on  a hot day in Austin would highly recommend. They knew all the hot spots to take us to to make sure we got the most out of our experience. I will be renting again soon!  Thanks Guys!",
            "editable": false
        },
        {
            "name": "Isabella Mormando",
            "rating": 5,
            "reviewText": "I had so much fun here with my friends!! The lake was so scenic and out driver was such a blast. Really made the experience memorable.",
            "editable": false
        },
        {
            "name": "Colton Porter",
            "rating": 5,
            "reviewText": "Amazing experience. 10/10 would do again. The lake is beautiful and the workers are comical and informative. Great family event.",
            "editable": false
        },
        {
            "name": "Ryan Albers",
            "rating": 5,
            "reviewText": "I had a great time on the lake this weekend. Will definitely be going on the lake with Shaky Pale again this summer!",
            "editable": false
        },
        {
            "name": "Sahej Singh",
            "rating": 5,
            "reviewText": "Such an incredible experience! The driver was so funny and my friends and I had a blast!",
            "editable": false
        },
        {
            "name": "Anupama Singh",
            "rating": 5,
            "reviewText": "Awesome bunch of guys running this rental. It was great fun. Everything went as planned. Will do it again.",
            "editable": false
        },
        {
            "name": "Amanda Halper",
            "rating": 5,
            "reviewText": "This is the best boat company! Shout out to Noah - best driver!",
            "editable": false
        },
        {
            "name": "James Jakubowski",
            "rating": 5,
            "reviewText": "Lake Travis is the best lake in the US of A partially due too Shaky Pale Marina",
            "editable": false
        },
        {
            "name": "Spencer H",
            "rating": 5,
            "reviewText": "Great time.",
            "editable": false
        },
        {
            "name": "Tyler Bartone",
            "rating": 5,
            "reviewText": "",
            "editable": false
        }
    ]
}